
#include "delay.h"

/**************************************
功能描述：延时函数，延时1us
入口参数：无
返回值：无
***************************************/
void Delay1us()		//@18.432MHz
{
	uint8 i;

	i = 2;
	while (--i);
}

/**************************************
功能描述：延时函数，延时1ms
入口参数：无
返回值：无
***************************************/
void Delay1ms()		//@18.432MHz
{
	uint8 i, j;

	i = 18;
	j = 235;
	do
	{
		while (--j);
	} while (--i);
}

/**************************************
功能描述：延时函数
入口参数：uint16 x ，该值为1时，延时1ms
返回值：无
***************************************/
void DelayMS(uint16 t)
{
	while(t--)
	{
		Delay1ms();
	}
}

/**************************************
功能描述：延时函数
入口参数：uint16 x ，该值为1时，延时1us
返回值：无
***************************************/
void DelayUS(uint16 t)
{
	while(t--)
	{
		Delay1us();
	}
}



